from typing import Dict, Any, Union

from redis import Redis
import requests
from bs4 import BeautifulSoup as bs
from config import user_agent, URL_24H
from pprint import pprint
import json
from datetime import datetime
import time
r = Redis(host='localhost', port=6379, db=0)

data_test = {
    "name": "Ю.Киммельманн - В.Оляновская",
    "odds": {
      "20.03.2020:15:12": {
        "П1": "2.04",
        "П2": "1.78"
      },
      "20.03.2020:14:12": {
        "П1": "2.04",
        "П2": "1.78"
    }
  }
}

"""r.set("10860986", json.dumps(data))
"""


request = requests.get(URL_24H, headers=user_agent).text
soup = bs(request, 'html.parser')
coupons = soup.find('div', {'class': 'sport-category-content'}).find_all('div', {'class': 'bg coupon-row'})
tree_id = soup.find('div', {'class': 'sport-category-content'}).find_all('div', {'class': 'bg coupon-row'})[0]['data-event-treeid']  # вместо индекса просто будет итерация
name_members = soup.find('div', {'class': 'sport-category-content'}).find_all('div', {'class': 'bg coupon-row'})[0]['data-event-name']  # вместо индекса просто будет итерация
odd_p_1 = json.loads(coupons[0].find_all('td', {'class': 'price height-column-with-price first-in-main-row coupone-width-1'})[0]['data-sel'])['epr']  # отсюда можно вытащить все коэфициенты
odd_p_2 = json.loads(coupons[0].find_all('td', {'class': 'price height-column-with-price coupone-width-1'})[0]['data-sel'])['epr']  # отсюда можно вытащить все коэфициенты

# ------------------------------------ПАРСЕР ✅-------------------------------------------------


def pusher():
    for coupon in coupons:

        id_ = coupon['data-event-treeid']
        members = coupon['data-event-name']
        time = str(datetime.now()).replace(" ", "")
        p1 = json.loads(coupon.find('td', {'class': 'price height-column-with-price first-in-main-row coupone-width-1'})['data-sel'])['epr']
        p2 = json.loads(coupon.find('td', {'class': 'price height-column-with-price coupone-width-1'})['data-sel'])['epr']
        # print(f'Смотрим данные = {id_} {members} {time} {p1} {p2}')  # Дебажный принт
        match = f'{id_}:{members}'
        odd = f"{round(float(p1), 2)}:{round(float(p2), 2)}"  # Создаю правильный элемент значение
        # print(f'данные матча = {match}, {odd}')
        r.rpush(match, odd)  # Делаю пуш на редис сервер

# ------------------------------------ПАРСЕР ✅-------------------------------------------------

#       ⬇️ ⬇️ ⬇️ ⬇️ ⬇️      Пытаюсь использовать rPush lRange lIndex    ⬇️ ⬇️ ⬇️ ⬇️ ⬇️

# print(r.lindex('savelii', -1))


#   ---   ---   ---   ---   ---   ---   ---   ---   ---   ---   ---   ---




# print(r.lrange('10919928', 0, -1))
# a = r.lindex('10919928', 0).decode()
# print(a, type(a), str(a).split(':'))



# if r.get(id_) is None:
#     print(f'Первый сценарий')
#
#     data = {"name": members, "odds": {time_: {"p1": round(float(p1), 2), "p2": round(float(p2), 2)} } }
#
#     r.set(id_, json.dumps(data))
#     print(f'Этого айди в базе не было, мы его добавили = {r.get(id_)}')
# match = json.loads(r.get(id_))
# print(f'match = {match}')
# # dict_new_odds = {time_: {"p1": p1, "p2": p2}}
# print(f"match по ключу odds = {dict(match)['odds']}")
# # r.set(id_, json.dumps(dict(match)['odds'].update(dict_new_odds)))
# print(match['odds'].update({time_: {"p1": p1, "p2": p2}}))
# r.set(id_, json.dumps(match['odds'].update({time_: {"p1": p1, "p2": p2}})))
# time.sleep(0.01)
#
# print(eval(r.get(id_)))

# print(f'Вот что получилось = {r.get(id_)}')

# 10890085

# -------------------------------------------------------------------------------------









"""
данные матча = 10919932:Э.Эскобедо - Р.Раманатан, 1.67:2.16
данные матча = 10919923:Х.Мунар - К.Табернер, 1.58:2.32
данные матча = 10919933:Л.Мусэтти - А.Табило, 1.29:3.5
данные матча = 10919884:А.Арнабольди - Т.Этчеверри, 2.28:1.57
данные матча = 10919890:Б.Кавчич - Н.Кун, 1.55:2.32
данные матча = 10919886:Ф.Мена - А.Пеллегрино, 3.1:1.33
данные матча = 10919889:Р.Сид Суберви - С.Агабигун, 1.05:7.8
данные матча = 10919957:Д.Галан/Э.Гомес - Й.Ковалик/М.Сафват, 1.58:2.32
данные матча = 10919956:Л.Мартинес/Д.Вега Эрнандес - С.Агабигун/Э.Киркин, 1.31:3.32
данные матча = 10919960:Р.Матос/Ф.Мелихени Родригес Альвес - П.Лоренци/Т.Сейбот Уилд, 1.18:4.55
данные матча = 10920036:М.Бурге - Л.Росол, 1.54:2.41
данные матча = 10920025:М.Жанвье - Б.Накашима, 2.82:1.41
данные матча = 10920031:Д.Кудла - К.Лестьенн, 1.74:2.04
данные матча = 10920033:М.Мартерер - С.Офнер, 1.34:3.14
данные матча = 10920028:Л.Пуйе - Ф.Горански, 1.57:2.34
данные матча = 10920027:Ю.Родионов - Э.Коко, 1.74:2.04
данные матча = 10920030:Т.Фаббиано - Я.Маден, 2.16:1.67
данные матча = 10920032:М.Хюслер - Б.Бонзи, 1.76:2.02
данные матча = 10920070:М.Бурге/Л.Пуйе - Д.Эйссерик/Э.Фюрнесс, 1.52:2.46
данные матча = 10920068:А.Горансcон/Д.Пел - Б.Накашима/Х.Рис, 1.3:3.4
данные матча = 10920066:С.Думбия/Ф.Ребуль - Б.Бонзи/Т.Ламазин, 1.98:1.79
данные матча = 10920069:А.Казо/У.Гастон - Г.Баррер/А.Оливетти, 2.99:1.37
данные матча = 10929586:Ф.Агаменоне/Э.Казанова - М.Арансабаль/Х.Барранко Косано, 1.22:3.9
данные матча = 10929637:Г.Чески/М.Вьертлер - Э.Дэвис/А.Нефедова, 2.36:1.56
данные матча = 10925412:Ф.Абанда - Д.Кисселл, 1.12:5.6
данные матча = 10925411:Л.Пулхартова - А.Гамис, 5.9:1.1
данные матча = 10925421:А.Санчес - Р.Ньюборн, 1.08:6.85
данные матча = 10925414:К.Хейнс - С.Уиттл, 3.9:1.22
данные матча = 10925422:И.Бурильо Эскориуэла - А.Замаррипа, 1.36:2.92
данные матча = 10925437:Л.Декмейере - М.Парто, 3.48:1.27
данные матча = 10925417:А.Окуно - М.Санчес, 2.69:1.42
данные матча = 10925408:М.Осака - С.Хамнер, 1.29:3.32
данные матча = 10925415:А.Аншба - Р.Брантмейер, 1.61:2.2
данные матча = 10925413:Р.Мкаду - М.Матеас, 2.85:1.38
данные матча = 10925410:Г.Прайс - Э.Бектас, 2.26:1.58



Смотрим данные = 10919923 Х.Мунар - К.Табернер 2021-01-2516:52:44.554745 1.62 2.24
Смотрим данные = 10919933 Л.Мусэтти - А.Табило 2021-01-2516:52:44.555246 1.28 3.54
Смотрим данные = 10919932 Э.Эскобедо - Р.Раманатан 2021-01-2516:52:44.555678 1.56 2.3600000000000003
Смотрим данные = 10919925 Х.Варильяс - Д.Петрович 2021-01-2516:52:44.556094 2.44 1.53
Смотрим данные = 10919927 Э.Гомес - Э.Киркин 2021-01-2516:52:44.556501 1.5699999999999998 2.34
Смотрим данные = 10919924 А.Джаннесси - Й.Ковалик 2021-01-2516:52:44.556907 2.67 1.45
Смотрим данные = 10919928 П.Лоренци - Д.Альтмайер 2021-01-2516:52:44.557315 3.26 1.32
Смотрим данные = 10919934 Р.Моллекер - Т.Робредо 2021-01-2516:52:44.557723 1.58 2.3200000000000003
Смотрим данные = 10919929 М.Сафват - Ж.Домингеш 2021-01-2516:52:44.558129 1.72 2.0700000000000003
Смотрим данные = 10919884 А.Арнабольди - Т.Этчеверри 2021-01-2516:52:44.558537 2.2800000000000002 1.5699999999999998
Смотрим данные = 10919890 Б.Кавчич - Н.Кун 2021-01-2516:52:44.558944 1.71 2.04
Смотрим данные = 10919886 Ф.Мена - А.Пеллегрино 2021-01-2516:52:44.559354 3.1 1.33
Смотрим данные = 10919889 Р.Сид Суберви - С.Агабигун 2021-01-2516:52:44.559759 1.055 7.8
Смотрим данные = 10919957 Д.Галан/Э.Гомес - Й.Ковалик/М.Сафват 2021-01-2516:52:44.560170 1.58 2.3200000000000003
Смотрим данные = 10919963 Э.Кинг/Н.Паша - Л.Майер/Х.Варильяс 2021-01-2516:52:44.560529 2.25 1.6153846153846154
Смотрим данные = 10919961 Л.Маргароли/Ф.Мергя - Х.Хелиоваара/З.Колар 2021-01-2516:52:44.560891 2.3899999999999997 1.55
Смотрим данные = 10919956 Л.Мартинес/Д.Вега Эрнандес - С.Агабигун/Э.Киркин 2021-01-2516:52:44.561253 1.31 3.32
Смотрим данные = 10919960 Р.Матос/Ф.Мелихени Родригес Альвес - П.Лоренци/Т.Сейбот Уилд 2021-01-2516:52:44.561617 1.184 4.55
Смотрим данные = 10919959 П.Раджа/Р.Раманатан - Т.Алтуна/Д.Петрович 2021-01-2516:52:44.561978 1.33 3.2
Смотрим данные = 10920035 Э.Фюрнесс - Р.Маркора 2021-01-2516:52:44.562347 1.56 2.3600000000000003
Смотрим данные = 10920026 У.Гастон - Г.Баррер 2021-01-2516:52:44.562756 2.4299999999999997 1.5333333333333332
Смотрим данные = 10920036 М.Бурге - Л.Росол 2021-01-2516:52:44.563208 1.5 2.52
Смотрим данные = 10920025 М.Жанвье - Б.Накашима 2021-01-2516:52:44.563623 2.8600000000000003 1.4
Смотрим данные = 10920031 Д.Кудла - К.Лестьенн 2021-01-2516:52:44.564042 1.72 2.0700000000000003
Смотрим данные = 10920033 М.Мартерер - С.Офнер 2021-01-2516:52:44.564453 1.3599999999999999 3.04
Смотрим данные = 10920028 Л.Пуйе - Ф.Горански 2021-01-2516:52:44.564862 1.5899999999999999 2.3
Смотрим данные = 10920027 Ю.Родионов - Э.Коко 2021-01-2516:52:44.565275 1.74 2.04
Смотрим данные = 10920030 Т.Фаббиано - Я.Маден 2021-01-2516:52:44.565680 2.2 1.6400000000000001
Смотрим данные = 10920032 М.Хюслер - Б.Бонзи 2021-01-2516:52:44.566093 1.87 1.8900000000000001
Смотрим данные = 10920070 М.Бурге/Л.Пуйе - Д.Эйссерик/Э.Фюрнесс 2021-01-2516:52:44.566506 1.52 2.46
Смотрим данные = 10920068 А.Горансcон/Д.Пел - Б.Накашима/Х.Рис 2021-01-2516:52:44.566870 1.29 3.46
Смотрим данные = 10920066 С.Думбия/Ф.Ребуль - Б.Бонзи/Т.Ламазин 2021-01-2516:52:44.567233 1.97 1.8
Смотрим данные = 10920069 А.Казо/У.Гастон - Г.Баррер/А.Оливетти 2021-01-2516:52:44.567596 2.99 1.37
Смотрим данные = 10925409 К.Волынец - Э.Колиман 2021-01-2516:52:44.567960 1.35 2.98
Смотрим данные = 10925418 А.Глатч - Э.Рутлифф 2021-01-2516:52:44.568321 1.1940298507462686 4.2
Смотрим данные = 10925416 К.Йокич - Р.Монтгомери 2021-01-2516:52:44.568685 3.36 1.2857142857142856
Смотрим данные = 10925423 К.Козаров - Т.Мур 2021-01-2516:52:44.569045 2.62 1.44
Смотрим данные = 10925412 Ф.Абанда - Д.Кисселл 2021-01-2516:52:44.569409 1.1150442477876106 5.6
Смотрим данные = 10925421 А.Санчес - Р.Ньюборн 2021-01-2516:52:44.569769 1.0761904761904761 6.85
Смотрим данные = 10925414 К.Хейнс - С.Уиттл 2021-01-2516:52:44.570131 3.9 1.22
Смотрим данные = 10925422 И.Бурильо Эскориуэла - А.Замаррипа 2021-01-2516:52:44.570493 1.4 2.77
Смотрим данные = 10925437 Л.Декмейере - М.Парто 2021-01-2516:52:44.570851 3.26 1.3
Смотрим данные = 10925417 А.Окуно - М.Санчес 2021-01-2516:52:44.571213 2.62 1.44
Смотрим данные = 10925408 М.Осака - С.Хамнер 2021-01-2516:52:44.571577 1.27 3.48
Смотрим данные = 10925415 А.Аншба - Р.Брантмейер 2021-01-2516:52:44.571944 1.53 2.375
Смотрим данные = 10925413 Р.Мкаду - М.Матеас 2021-01-2516:52:44.572309 2.85 1.38
Смотрим данные = 10925410 Г.Прайс - Э.Бектас 2021-01-2516:52:44.572676 2.26 1.58
Смотрим данные = 10927013 О.Альби - Т.Андрианяфитримо 2021-01-2516:52:44.573038 2.77 1.4
Смотрим данные = 10927015 Р.Шрамкова - Ц.Чжэн 2021-01-2516:52:44.573401 3.36 1.2857142857142856
"""























# r.mset({'Norway': 'Osli', 'Turkey': 'Istambul', 'Russia': 'Moscow'})  # Он принимает тут mapping, скорми ему словарики

# # ----------------------------Пример записи словаря в редис-----------------------------------------------------
# restaurant_484272 = {
#     "name": "Ravagh",
#     "type": "Persian",
#     "address": {
#         "street": {
#             "line1": "11 E 30th St",
#             "line2": "APT 1",
#         },
#         "city": "New York",
#         "state": "NY",
#         "zip": 10016,
#     }
# }
"""
r.set(484272, json.dumps(restaurant_484272))     <------------  Записываем вот таким образом

r.get(484272)    <--------------   Получаем таким образом

print(json.loads(r.get(484272)))  <--------------   Получаем нормальным образом
"""
# ----------------------------Пример записи словаря в редис-----------------------------------------------------


# pprint(json.loads(r.get(484272)))








# r.hmset(json.dumps({
#   "10860986": {
#     "name": "Ю.Киммельманн - В.Оляновская",
#     "odds": {
#       "20.03.2020:14:12": {
#         "П1": "2.04",
#         "П2": "1.78"
#       },
#       "20.03.2020:15:12": {
#         "П1": "2.04",
#         "П2": "1.78"
#       }
#     }
#   }
# }
# )
# )





# {"10860986":
# {"name": "Ю.Киммельманн - В.Оляновская",
# "odds":
# {"20.03.2020:14:12": {"П1": "2.04","П2": "1.78"}},
# {"20.03.2020:15:12": {"П1": "2.51","П2": "1.23"}}}