from redis_cash import pusher, r

# pusher()

#print(r.lrange(10919890, 0, -1))  # [b'1.71:2.04', b'1.71:2.04', b'1.46:2.56']
#print(r.lrange(10920026, 0, -1))  # [b'2.41:1.54', b'2.41:1.54', b'2.39:1.55']
#print(r.lrange(10919889, 0, -1))  # [b'1.055:7.8', b'1.05:7.8', b'1.05:7.8']

# ------------------------------ЛОГИКА--------------------------------------------



example = 10925422

# a = r.keys(f'{example}:*')[0].decode() # Так можно выципить полный ключь этого значения

if '/' in a:
    print('Матч парный, ставим ТБ2.5')
else:
    print('Матч не парный')

if float(r.lindex(example, 0).decode().split(':')[0]) < 1.11:
    print('Матч соло, есть явный фаворит, ставим ТМ2.5')
elif float(r.lindex(example, 0).decode().split(':')[1]) < 1.11:
    print('Матч соло, есть явный фаворит, ставим ТМ2.5')
else:
    print('Матч соло, явного фаворита нет')




#             |-----------------------------------------|
#             |  ЧТОБЫ ПОЛУЧИТЬ ВАЛИДНОЕ ЗНАЧЕНИЕ НАДО: |
#             | a = r.lindex('10919928', 0).decode()    |
#             | print(a, type(a), str(a).split(':'))    |
#             |-----------------------------------------|

